Examinator/src/InformationRegisters/ПользователиВебКабинетаСУ/ПользователиВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиВебКабинетаСУ</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПользователиВебКабинетаСУ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

/////////////////////////////////////////////////////////////////
// ПОЛЬЗОВАТЕЛИ ВЕБ-КАБИНЕТА

Процедура ЗаписатьПользователя(Пользователь, ИдентификаторПользователяИБ = Неопределено, Отказ = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем реквизиты
	
	Если ИдентификаторПользователяИБ = Неопределено Тогда
		ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");	
	КонецЕсли;
	
	// Находим пользователя ИБ
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
	
	Если ПользовательИБ = Неопределено Тогда		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Пользователь %1 информационный базы не найден'"), Пользователь.Наименование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
		
	Имя                       = ПользовательИБ.Имя;
	СохраняемоеЗначениеПароля = Сред(ПользовательИБ.СохраняемоеЗначениеПароля, 1, Найти(ПользовательИБ.СохраняемоеЗначениеПароля, ",")-1);
	
	// Записываем нового пользователя или перезаписываем существующего
	
	НаборЗаписей = РегистрыСведений.ПользователиВебКабинетаСУ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.Имя = Имя;
	НоваяЗапись.СохраняемоеЗначениеПароля = СохраняемоеЗначениеПароля;
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();
	НоваяЗапись.Ответственный = Пользователи.ТекущийПользователь();
	НоваяЗапись.Права = Новый ХранилищеЗначения(ВебКабинетСУ.ПраваПользователя(Пользователь));
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновитьПользователя(Пользователь) Экспорт
	
	// Ищем пользователя в регистре
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиВебКабинетаСУ.Пользователь
		|ИЗ
		|	РегистрСведений.ПользователиВебКабинетаСУ КАК ПользователиВебКабинетаСУ
		|ГДЕ
		|	ПользователиВебКабинетаСУ.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ЗаписатьПользователя(Пользователь);
	
КонецПроцедуры

Процедура УдалитьПользователя(Имя = Неопределено, Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = ЗапросПользователей(Имя, Пользователь);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		НаборЗаписей = РегистрыСведений.ПользователиВебКабинетаСУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ВыборкаДетальныеЗаписи.Пользователь);
		НаборЗаписей.Записать();

	КонецЦикла;
		
КонецПроцедуры

Функция ПользовательСуществует(Имя = Неопределено, Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Имя) И НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = ЗапросПользователей(Имя, Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), Ложь, Истина);
	
КонецФункции

Функция ДанныеПользователя(Имя = Неопределено, Пользователь = Неопределено) Экспорт
	
	Запрос = ЗапросПользователей(Имя, Пользователь);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ВыборкаДетальныеЗаписи.Следующий();
	
	ДанныеПользователя = Новый Структура;
	
	Колонки = ОбщегоНазначенияСУ.КолонкиЗапроса(Запрос);
	
	Для каждого ИмяКолонки Из Колонки Цикл
		ДанныеПользователя.Вставить(ИмяКолонки,  ВыборкаДетальныеЗаписи[ИмяКолонки]);
	КонецЦикла;
	
	Возврат ДанныеПользователя;
	
КонецФункции

/////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ

Функция ЗапросПользователей(Знач Имя = Неопределено, Знач Пользователь = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиВебКабинетаСУ.Имя,
		|	ПользователиВебКабинетаСУ.СохраняемоеЗначениеПароля,
		|	ПользователиВебКабинетаСУ.Пользователь,
		|	ПользователиВебКабинетаСУ.Права
		|ИЗ
		|	РегистрСведений.ПользователиВебКабинетаСУ КАК ПользователиВебКабинетаСУ";

	Если Имя <> Неопределено ИЛИ Пользователь <> Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + " ГДЕ ";
		
		Если Имя <> Неопределено Тогда
			Запрос.Текст = Запрос.Текст + " ПользователиВебКабинетаСУ.Имя = &Имя И ";
			Запрос.Параметры.Вставить("Имя", Имя);
		КонецЕсли;
		
		Если Пользователь <> Неопределено Тогда
			Запрос.Текст = Запрос.Текст + " ПользователиВебКабинетаСУ.Пользователь = &Пользователь И ";
			Запрос.Параметры.Вставить("Пользователь", Пользователь);
		КонецЕсли;
		
		Запрос.Текст = Сред(Запрос.Текст, 1, СтрДлина(Запрос.Текст)-2);
		
	КонецЕсли;	
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#КонецЕсли
